/*******************************************************************************
Copyright (C) 2016 Annapurna Labs Ltd.

This file may be licensed under the terms of the Annapurna Labs Commercial
License Agreement.

Alternatively, this file can be distributed under the terms of the GNU General
Public License V2 as published by the Free Software Foundation and can be
found at http://www.gnu.org/licenses/gpl-2.0.html

Alternatively, redistribution and use in source and binary forms, with or
without modification, are permitted provided that the following conditions are
met:

    *     Redistributions of source code must retain the above copyright notice,
this list of conditions and the following disclaimer.

    *     Redistributions in binary form must reproduce the above copyright
notice, this list of conditions and the following disclaimer in
the documentation and/or other materials provided with the
distribution.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON

#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_ADDR				0x00000034
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_CLAUSE22_REG_ADDR_MASK		0x0000001f
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_CLAUSE22_REG_ADDR_SHIFT	0
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_CLAUSE22_PHY_ADDR_MASK		0x000003e0
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_CLAUSE22_PHY_ADDR_SHIFT	5
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_CLAUSE45_DEV_ADDR_MASK		0x0000001f
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_CLAUSE45_DEV_ADDR_SHIFT	0
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_CLAUSE45_PORT_ADDR_MASK	0x000003e0
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_CLAUSE45_PORT_ADDR_SHIFT	5
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_CLAUSE45_POST_INC		AL_BIT(14)
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_COMMAND_READ				AL_BIT(15)
/* mdio data */
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_DATA_ADDR				0x00000038
/* mdio regaddr */
#define ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_REGADDR_ADDR				0x0000003C
/* mdio clause 22 (0) or 45 (1) */
#define AL_ETH_MAC_GEN_V4_MAC_50G_100G_MDIO_C22_OR_C45				AL_BIT(6)

/*** CMAC MDIO ***/
#define ETH_MAC_GEN_V4_MAC_100G_MDIO_CFG_STATUS_HOLD_TIME_1_CLK	0
#define ETH_MAC_GEN_V4_MAC_100G_MDIO_CFG_STATUS_HOLD_TIME_2_CLK	1
#define ETH_MAC_GEN_V4_MAC_100G_MDIO_CFG_STATUS_HOLD_TIME_3_CLK	2
#define ETH_MAC_GEN_V4_MAC_100G_MDIO_CFG_STATUS_HOLD_TIME_4_CLK	3

#define ETH_MAC_GEN_V4_MAC_100G_MDIO_CFG_STATUS_CLK_DIV_MASK	0x0000ff00
#define ETH_MAC_GEN_V4_MAC_100G_MDIO_CFG_STATUS_CLK_DIV_SHIFT	8

/*** LMAC MDIO ***/
#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_HOLD_TIME_1_CLK	0
#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_HOLD_TIME_3_CLK	1
#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_HOLD_TIME_5_CLK	2
#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_HOLD_TIME_7_CLK	3
#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_HOLD_TIME_9_CLK	4
#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_HOLD_TIME_11_CLK	5
#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_HOLD_TIME_13_CLK	6
#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_HOLD_TIME_15_CLK	7

#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_DIS_PREAMBLE	AL_BIT(5)

#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_CLK_DIV_MASK	0x0000ff80
#define ETH_MAC_GEN_V4_MAC_50G_MDIO_CFG_STATUS_CLK_DIV_SHIFT	7

/* mdio constants */
#define AL_ETH_MDIO_DELAY_PERIOD	1 /* micro seconds to wait when polling mdio status */
#define AL_ETH_MDIO_DELAY_COUNT		150 /* number of times to poll */

#define ETH_MAC_GEN_V4_MAC_MODE_MASK	0x000000ff
#define ETH_MAC_GEN_V4_MAC_MODE_SHIFT	0

#define ETH_MAC_GEN_V4_FEC_ENABLE_MASK	0x00000f00
#define ETH_MAC_GEN_V4_FEC_ENABLE_SHIFT	8

/* RS-FEC Registers Addresses */
#define ETH_MAC_GEN_V4_PCS_RS_FEC_REG_CCW	4
#define ETH_MAC_GEN_V4_PCS_RS_FEC_REG_NCCW	8

enum mac_v4_mdio_cmd_type {
	MAC_V4_MDIO_CMD_TYPE_READ = 0,
	MAC_V4_MDIO_CMD_TYPE_WRITE = 1,
};

#define ETH_MAC_GEN_RATE_COUNTER_WIN_LEN_UNITS_NS	2
#define ETH_MAC_GEN_RATE_COUNTER_MAX_WIN		(ETH_MAC_GEN_RATE_COUNTER_WIN_LEN_UNITS_NS \
							* (~0ULL))

struct al_eth_mac_100g_stats_v4 {
	uint32_t reserved53[32];
	uint32_t frames_txed_ok;				/* 0x80 */
	uint32_t reserved54;
	uint32_t frames_rxed_ok;				/* 0x88 */
	uint32_t reserved55;
	uint32_t fcs_errors;					/* 0x90 */
	uint32_t reserved56;
	uint32_t alignment_errors;				/* 0x98 */
	uint32_t reserved57;
	uint32_t pause_mac_ctrl_frames_txed;			/* 0xA0 */
	uint32_t reserved58;
	uint32_t pause_mac_ctrl_frames_rxed;			/* 0xA8 */
	uint32_t reserved59;
	uint32_t frame_too_long_errs;				/* 0xB0 */
	uint32_t reserved60;
	uint32_t in_range_length_errs;				/* 0xB8 */
	uint32_t reserved61;
	uint32_t vlan_txed_ok;					/* 0xC0 */
	uint32_t reserved62;
	uint32_t vlan_rxed_ok;					/* 0xC8 */
	uint32_t reserved63;
	uint32_t if_out_octets_l;				/* 0xD0 */
	uint32_t if_out_octets_h;				/* 0xD4 */
	uint32_t if_in_octets_l;				/* 0xD8 */
	uint32_t if_in_octets_h;				/* 0xDC */
	uint32_t if_in_ucast_pkts;				/* 0xE0 */
	uint32_t reserved68;
	uint32_t if_in_mcast_pkts;				/* 0xE8 */
	uint32_t reserved69;
	uint32_t if_in_bcast_pkts;				/* 0xF0 */
	uint32_t reserved70;
	uint32_t if_out_errors;					/* 0xF8 */
	uint32_t reserved71[3];
	uint32_t if_out_ucast_pkts;				/* 0x108 */
	uint32_t reserved72;
	uint32_t if_out_mcast_pkts;				/* 0x110 */
	uint32_t reserved73;
	uint32_t if_out_bcast_pkts;				/* 0x118 */
	uint32_t reserved74;
	uint32_t drop_events;					/* 0x120 */
	uint32_t reserved75;
	uint32_t octets_l;					/* 0x128 */
	uint32_t octets_h;					/* 0x12C */
	uint32_t pkts;						/* 0x130 */
	uint32_t reserved78;
	uint32_t undersize_pkts;				/* 0x138 */
	uint32_t reserved79;
	uint32_t pkts_64_octets;				/* 0x140 */
	uint32_t reserved80;
	uint32_t pkts_65_to_127_octets;				/* 0x148 */
	uint32_t reserved81;
	uint32_t pkts_128_to_255_octets;			/* 0x150 */
	uint32_t reserved82;
	uint32_t pkts_256_to_511_octets;			/* 0x158 */
	uint32_t reserved83;
	uint32_t pkts_512_to_1023_octets;			/* 0x160 */
	uint32_t reserved84;
	uint32_t pkts_1024_to_1518_octets;			/* 0x168 */
	uint32_t reserved85;
	uint32_t pkts_1519_to_max_octets;			/* 0x170 */
	uint32_t reserved86;
	uint32_t oversize_pkts;					/* 0x178 */
	uint32_t reserved88;
	uint32_t jabbers;					/* 0x180 */
	uint32_t reserved89;
	uint32_t fragments;					/* 0x188 */
	uint32_t reserved90;
	uint32_t if_in_errors;					/* 0x190 */
	uint32_t reserved91;
	uint32_t cbfc_pause_frames_txed_0;			/* 0x198 */
	uint32_t reserved92;
	uint32_t cbfc_pause_frames_txed_1;			/* 0x1A0 */
	uint32_t reserved93;
	uint32_t cbfc_pause_frames_txed_2;			/* 0x1A8 */
	uint32_t reserved94;
	uint32_t cbfc_pause_frames_txed_3;			/* 0x1B0 */
	uint32_t reserved95;
	uint32_t cbfc_pause_frames_txed_4;			/* 0x1B8 */
	uint32_t reserved96;
	uint32_t cbfc_pause_frames_txed_5;			/* 0x1C0 */
	uint32_t reserved97;
	uint32_t cbfc_pause_frames_txed_6;			/* 0x1C8 */
	uint32_t reserved98;
	uint32_t cbfc_pause_frames_txed_7;			/* 0x1D0 */
	uint32_t reserved99;
	uint32_t cbfc_pause_frames_rxed_0;			/* 0x1D8 */
	uint32_t reserved100;
	uint32_t cbfc_pause_frames_rxed_1;			/* 0x1E0 */
	uint32_t reserved101;
	uint32_t cbfc_pause_frames_rxed_2;			/* 0x1E8 */
	uint32_t reserved102;
	uint32_t cbfc_pause_frames_rxed_3;			/* 0x1F0 */
	uint32_t reserved103;
	uint32_t cbfc_pause_frames_rxed_4;			/* 0x1F8 */
	uint32_t reserved104;
	uint32_t cbfc_pause_frames_rxed_5;			/* 0x200 */
	uint32_t reserved105;
	uint32_t cbfc_pause_frames_rxed_6;			/* 0x208 */
	uint32_t reserved106;
	uint32_t cbfc_pause_frames_rxed_7;			/* 0x210 */
	uint32_t reserved107;
	uint32_t mac_ctrl_frames_txed;				/* 0x218 */
	uint32_t reserved108;
	uint32_t mac_ctrl_frames_rxed;				/* 0x220 */
	uint32_t reserved109;
	uint32_t tx_octets;					/* 0x228 */
	uint32_t reserved110;
	uint32_t tx_pkts;					/* 0x230 */
	uint32_t reserved111;
	uint32_t tx_pkts_64_octets;				/* 0x238 */
	uint32_t reserved112;
	uint32_t tx_pkts_65_to_127_octets;			/* 0x240 */
	uint32_t reserved113;
	uint32_t tx_pkts_128_to_255_octets;			/* 0x248 */
	uint32_t reserved114;
	uint32_t tx_pkts_256_to_511_octets;			/* 0x250 */
	uint32_t reserved115;
	uint32_t tx_pkts_512_to_1023_octets;			/* 0x258 */
	uint32_t reserved116;
	uint32_t tx_pkts_1024_to_1518_octets;			/* 0x260 */
	uint32_t reserved117;
	uint32_t tx_pkts_1519_to_max_octets;			/* 0x268 */
};

struct al_eth_mac_50g_stats_v4 {
	uint32_t reserved1[64];
	/* 0x100 */
	struct al_eth_mac_10g_stats_v3_rx	rx;
	/* 0x200 */
	struct al_eth_mac_10g_stats_v3_tx	tx;
};

/**
 * read 50G MAC registers (indirect access)
 *
 * @param mac_regs_base MAC register base
 * @param reg_addr address in the an registers
 *
 * @return the register value
 */

static uint32_t al_eth_50g_mac_reg_read(
			struct al_eth_mac_v4_regs *mac_regs_base,
			uint32_t reg_addr)
{
	uint32_t val;

	/* indirect access */
	al_reg_write32(&mac_regs_base->mtip.mac_50g_addr, reg_addr);
	val = al_reg_read32(&mac_regs_base->mtip.mac_50g_data);

	al_dbg("%s: reg %d. val 0x%x\n", __func__, reg_addr, val);

	return val;
}

static uint64_t al_eth_50g_mac_reg_read64(
	struct al_eth_mac_v4_regs *mac_regs_base,
	uint32_t reg_addr)
{
	uint64_t val;

	/* indirect access */
	al_reg_write32(&mac_regs_base->mtip.mac_50g_addr, reg_addr);
